<script setup lang="ts">
import Container from '@/layout/Container.vue'
</script>

<template>
  <Container>
    <article class="prose max-w-none my-10">
      <h1 class="border-b pb-3">
        Тестовое задание для Frontend
      </h1>
      <h2 class="border-b pb-3">
        Суть задания
      </h2>
      <p>Разработать фронтенд приложения для быстрого поиска информации по фильмам и сериалам с платформы «Кинопоиска».</p>
      <h2 class="border-b pb-3">
        Общие вводные
      </h2>
      <ul>
        <li>Тестовое необходимо реализовать с использованием <a href="https://api.kinopoisk.dev/documentation">API Кинопоиска</a>. Токен для доступа API предоставлен отдельно в письме с почты <a href="mailto:interships@avito.ru">interships@avito.ru</a>.</li>
        <li>
          <em><strong>Важно: при работе над тестовым, убедитесь, что токен не расположен в вашем GitHub публично</strong></em>
        </li>
        <li>Результат тестового должен соответствовать требованиям описанным ниже.</li>
        <li>В пунктах «Будет плюсом» обозначены требования, выполнять которые не обязательно, но даже частичное выполнение этих пунктов позволит лучше раскрыть ваши знания и навыки.</li>
      </ul>
      <h2 class="border-b pb-3">
        Функциональные требования
      </h2>
      <p>Приложение должно состоять из двух страниц:</p>
      <ol>
        <li>Страница со списком всех фильмов</li>
        <li>Страница отдельного фильма</li>
      </ol>
      <h4>На странице со списком всех фильмов:</h4>
      <ol>
        <li>Отображается список фильмов и сериалов</li>
        <li>Реализована пагинация</li>
        <li>Можно выбрать количество фильмов для показа на странице (по умолчанию должно быть 10)</li>
        <li>Можно отфильтровать выдачу (по году, стране и возрастному рейтингу)</li>
        <li>Реализован поиск по названию фильма</li>
        <li>Можно перейти на страницу фильма из выдачи</li>
      </ol>
      <h4>Будет плюсом:</h4>
      <ol>
        <li>Если реализована возможность поделиться результатами выдачи с другими пользователями через копирование ссылки. (Подсказка: для этого можно записывать в query-параметры фильтры и пагинацию)</li>
        <li>Если сохраняется история поиска (например, последние 20 запросов)</li>
        <li>Если при вводе нового названия появляется suggest с предложениями из ранее введенных значений</li>
        <li>Если при вводе значений происходит фильтрация подсказок по вхождению.  Например, при вводе «бой»: могут быть предложены результаты, содержащие «бой»: «при<strong>бой</strong>», «<strong>бой</strong>кий», «беспере<strong>бой</strong>ность» и т.д. (Ориентир: поиск в Google, который предлагает варианты из предыдущих запросов)</li>
        <li>Если поиск осуществляется не при каждом вводе символа, а в момент когда с ввода последнего символа прошла 1 секунда (debounce)</li>
      </ol>
      <h4>На странице с отдельным фильмом:</h4>
      <ol>
        <li>
          Отображается информация о фильме или сериале, в том числе:
          <ul>
            <li>название фильма/сериала</li>
            <li>описание</li>
            <li>рейтинг</li>
            <li>список актёров (с пагинацией, если их больше 10);</li>
            <li>список сезонов и серий (с пагинацией, если они подразумеваются))</li>
            <li>отзывы пользователей (с пагинацией)</li>
            <li>постеры, отображение которых реализовано в виде «карусели»</li>
          </ul>
        </li>
        <li>Реализован вывод списка фильмов, похожих на текущий, в виде «карусели». По каждому элементу можно кликнуть и открыть его страницу</li>
        <li>В случае, если какой-то из списков пустой (список отзывов, актёров, сезонов), реализовано отображение заглушки на подобие «нет информации о ...»</li>
        <li>Реализована кнопка «назад», которая ведет на выдачу. Фильтры и номер страницы при этом должны сохраняться.</li>
      </ol>
      <h3>Будет плюсом ко всей работе:</h3>
      <ol>
        <li>Если будет реализована авторизация. Проверку пароля можно захардкодить</li>
        <li>
          Если будет реализована страница c поиском рандомного фильма как тут: <a href="https://www.kinopoisk.ru/chance/">референс</a>. При этом на этой странице будет реализована следующая функциональность:
          <ul>
            <li>страница с рандомным поиском будет доступна только авторизованным пользователям</li>
            <li>есть возможность установить фильтры: по жанру, по стране производства, по типу контента (сериал/фильм), по году выпуска, по рейтингу Кинопоиска (от конкретного значения), по сети производства (HBO, Netflix и т.п.)</li>
            <li>есть кнопка «Случайный фильм», которая перекидывает на страницу найденного фильма</li>
          </ul>
        </li>
      </ol>
      <h2 class="border-b pb-3">
        Нефункциональные требования
      </h2>
      <ol>
        <li>
          Стек технологий:
          <ul>
            <li>фронтенд фреймворк: React, версия 18</li>
            <li>
              можно использовать любую общедоступную библиотеку компонент. Примеры: <a href="https://ant.design/">ant.design</a>, <a href="https://mantine.dev/">mantine</a>, <a href="https://react-bootstrap.github.io/">react-bootstrap</a>
            </li>
            <li>сборщик: Webpack</li>
            <li>Node.js: 18 или выше</li>
            <li>пакетный менеджер: npm</li>
          </ul>
        </li>
        <li>
          Запуск проекта в режиме разработчика должен происходить по команде <code>TOKEN=&lt;your api token&gt; npm run start</code> ; проект должен быть доступен по ссылке <a href="http://localhost:7070">http://localhost:7070</a>
        </li>
        <li>Реализован адаптивный интерфейс: с приложением должно быть удобно работать, как с мобильного экрана, так и с десктопа</li>
        <li>
          Роутинг выполнен с использованием <a href="https://reactrouter.com/en/main">React Router v6</a>
        </li>
        <li>При переходах по ссылкам страница не перезагружается (SPA, без next.js)</li>
      </ol>
      <p><em><strong>Напомним, важно: при работе над тестовым, убедитесь, что токен не расположен в вашем GitHub публично</strong></em></p>
      <p><strong>Будет плюсом:</strong></p>
      <ol>
        <li>Использование TypeScript</li>
        <li>Наличие docker-файла для запуска</li>
        <li>Реализация возможности выполнения трёх попыток повторного запроса, если запрос был неудачным</li>
        <li>Если при переходе со страницы на страницу, запросы, относящиеся к старой странице, прерываются (отменяются/прекращаются)</li>
        <li>Покрытие кода юнит-тестами</li>
      </ol>
      <h2 class="border-b pb-3">
        Ход решения
      </h2>
      <p>
        Если у вас возникнут вопросы по заданию, ответы на которые вы не найдете в описанных требованиях, то вы вольны принимать решения самостоятельно.<br>
        В таком случае приложите к проекту README-файл, в котором будет список вопросов/проблем, с которыми вы столкнулись, и поясните как вы их решили и почему именно таким образом.
      </p>
      <h2 class="border-b pb-3">
        Оформление решения
      </h2>
      <p>Необходимо предоставить публичный git-репозиторий на любом публичном хосте (GitHub / GitLab / etc), содержащий в master/main ветке:</p>
      <ol>
        <li>Код сервиса</li>
        <li>Описанная в README.md инструкция по запуску</li>
        <li>Описанные в README.md вопросы/проблемы, с которыми столкнулись, и ваша логика их решений (если требуется)</li>
      </ol>
    </article>
  </Container>
</template>
